import numpy
from scipy import stats


# 请使用 NumPy mean() 方法确定平均速度：
speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]
x = numpy.mean(speed)
print(x)

# 请使用 NumPy median() 方法找到中间值：
speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]
x = numpy.median(speed)
print(x)

# 如果中间有两个数字，则将这些数字之和除以 2。
# 77, 78, 85, 86, 86, 86, 87, 87, 94, 98, 99, 103      
# (86 + 87) / 2 = 86.5
# 使用 NumPy 模块：
speed = [99,86,87,88,86,103,87,94,78,77,85,86]
x = numpy.median(speed)
print(x)

# 众数
# 众值是出现次数最多的值：
# 99, 86, 87, 88, 111, 86, 103, 87, 94, 78, 77, 85, 86 = 86
# SciPy 模块拥有用于此目的的方法：
# 请使用 SciPy mode() 方法查找出现次数最多的数字：
speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]
x = stats.mode(speed)
print(x)

# 章节总结
# 均值、中值和众数是机器学习中经常使用的技术，因此了解它们背后的概念很重要